Belief997/lab-Micro_power_consumption_backscatter/KinetisSDK/examples/frdmkl03z/demo_apps/power_manager_hal_demo/main.c
#define HWTIMER_ISR_PRIOR       5
#define HWTIMER_PERIOD          10000
#define HWTIMER_DOTS_PER_LINE   40
#define HWTIMER_LINES_COUNT     4

///////////////////////////////////////////////////////////////////////////////
// Variables
///////////////////////////////////////////////////////////////////////////////

extern const hwtimer_devif_t kSystickDevif;
extern const hwtimer_devif_t kPitDevif;
hwtimer_t hwtimer;


static uint8_t flag;

void hwtimer_callback(void* data)
{
    PRINTF("!.");
    if ((HWTIMER_SYS_GetTicks(&hwtimer) % HWTIMER_DOTS_PER_LINE) == 0)
    {
        PRINTF("\r\n");
    }
    if ((HWTIMER_SYS_GetTicks(&hwtimer) % (HWTIMER_LINES_COUNT * HWTIMER_DOTS_PER_LINE)) == 0)
    {
        if (kHwtimerSuccess != HWTIMER_SYS_Stop(&hwtimer))
        {
            PRINTF("\r\nError: hwtimer stop.\r\n");
        }
        PRINTF("End\r\n");
        flag = 1;
    }
}





#endif
// TIMER END


/*!
 * @brief main demo function.
 */
int main(void) {
#if 0
    demo_power_modes_t testVal = kDemoRun;
    uint8_t mode;
    power_manager_error_code_t ret = kPowerManagerSuccess;
    uint32_t freq = 0;
    rtc_datetime_t date =
    {
        .year = 2014U,
        .month = 4U,
        .day = 30U,
        .hour = 14U,
        .minute = 0U,
        .second = 0U,
    };

    // Example of constant configuration
    // It may save the space in RAM
    const power_manager_user_config_t vlprConfig = {
        .mode = kPowerManagerVlpr,
        .sleepOnExitValue = false,
    };
    power_manager_user_config_t vlpwConfig     =    vlprConfig;
    power_manager_user_config_t vlls0Config    =    vlprConfig;
    power_manager_user_config_t vlls1Config    =    vlprConfig;
    power_manager_user_config_t vlls3Config    =    vlprConfig;
    power_manager_user_config_t vlpsConfig     =    vlprConfig;
    power_manager_user_config_t waitConfig     =    vlprConfig;
    power_manager_user_config_t stopConfig     =    vlprConfig;
    power_manager_user_config_t runConfig      =    vlprConfig;

    // Initializes array of pointers to power manager configurations
    power_manager_user_config_t const *powerConfigs[] =
    {
      &runConfig,
      &waitConfig,
      &stopConfig,
      &vlprConfig,
      &vlpwConfig,
      &vlpsConfig,
      &vlls0Config,
      &vlls1Config,
      &vlls3Config,
    };

    // User callback data
    user_callback_data_t callbackData0;

    // Initializes callback configuration structure for power manager
    power_manager_callback_user_config_t callbackCfg0 = { callback0,
        kPowerManagerCallbackBeforeAfter,
        (power_manager_callback_data_t*) &callbackData0 };

    // Initializes array of pointers to power manager callbacks
    power_manager_callback_user_config_t * callbacks[] =
    { &callbackCfg0 };
#endif
    // Initializes hardware
    hardware_init();
#if 0
    // Initializes OS abstraction layer which uses LPTMR HAL layer
    OSA_Init();

    // Make the current Clock Manager mode configuration 1 (default configuration)
    /* Set clock configurations to clock manager. */
    CLOCK_SYS_Init(g_defaultClockConfigurations, CLOCK_NUMBER_OF_CONFIGURATIONS,
                   clockCallbackTable, ARRAY_SIZE(clockCallbackTable));

    CLOCK_SYS_UpdateConfiguration(CLOCK_RUN, kClockManagerPolicyForcible);
    // select the 1Hz for RTC_CLKOUT
    CLOCK_SYS_SetRtcOutSrc(kClockRtcoutSrc1Hz);

    /* Enable clock gate to RTC module */
    CLOCK_SYS_EnableRtcClock( 0U);

    /* Initialize the general configuration for RTC module.*/
    RTC_HAL_Init(RTC_BASE_PTR);

    BOARD_InitRtcOsc();

    /* Enable the RTC Clock output */
    RTC_HAL_SetClockOutCmd(RTC_BASE_PTR, true);

    NVIC_ClearPendingIRQ(RTC_IRQn);

    INT_SYS_EnableIRQ(RTC_IRQn);

    //RTC_DRV_SetDatetime(0, &date);
    RTC_HAL_SetDatetime(RTC_BASE_PTR, &date);
   // Initializes GPIO driver for LEDs and buttons
    GPIO_DRV_Init(switchPins, ledPins);

    memset(&callbackData0, 0, sizeof(user_callback_data_t));

    // initializes configuration structures
    vlpwConfig.mode = kPowerManagerVlpw;

    // VLLS0 mode is supported only by some SOCs.
    vlls0Config.mode = kPowerManagerVlls0;

    vlls1Config.mode = kPowerManagerVlls1;
    vlls3Config.mode = kPowerManagerVlls3;
    vlpsConfig.mode = kPowerManagerVlps;

    waitConfig.mode = kPowerManagerWait;

    stopConfig.mode = kPowerManagerStop;

    runConfig.mode  = kPowerManagerRun;

    // initialize power manager driver
    POWER_SYS_Init(powerConfigs,
    sizeof(powerConfigs)/sizeof(power_manager_user_config_t *),
    callbacks,
    sizeof(callbacks)/sizeof(power_manager_callback_user_config_t *));

    // Enables LLWU interrupt
    INT_SYS_EnableIRQ(LLWU_IRQn);




    	//// enter vlpr mode
    {
		mode = kDemoVlpr - kDemoMin - 1;
		if(kPowerManagerVlpr != POWER_SYS_GetCurrentMode())
		{
			update_clock_mode(CLOCK_VLPR);
//			PRINTF("Entering Very Low Power Run mode\r\n");
			PRINTF("VLPR\r\n");
			ret = POWER_SYS_SetMode(mode, kPowerManagerPolicyAgreement);
			CHECK_RET_VAL(ret, mode);
		}
		else
		{
//			PRINTF("Very Low Power Run mode already active\r\n");
			PRINTF("VLPR already\r\n");
		}
    }
#endif


    ////  config timer and start

////    if(kPowerManagerVlpr == POWER_SYS_GetCurrentMode())
//    {
//    	uint8_t ret = 0;
//        // Hwtimer initialization
//                if (kHwtimerSuccess != HWTIMER_SYS_Init(&hwtimer, &HWTIMER_LL_DEVIF, HWTIMER_LL_ID, NULL))
//                {
////                    PRINTF("\r\nError: hwtimer initialization.\r\n");
//                	ret += 0x10;
//                }
//        /*
//         * In case you wish to raise the Systick ISR priority, then use the below command with the
//         * appropriate priority setting:
//         * NVIC_SetPriority(SysTick_IRQn, isrPrior);
//         */
//                NVIC_SetPriority(SysTick_IRQn, HWTIMER_ISR_PRIOR);
//
//                if (kHwtimerSuccess != HWTIMER_SYS_SetPeriod(&hwtimer, HWTIMER_PERIOD))
//                {
//                	ret += 0x01;
////                    PRINTF("\r\nError: hwtimer set period.\r\n");
//                }
//                if (kHwtimerSuccess != HWTIMER_SYS_RegisterCallback(&hwtimer, hwtimer_callback, NULL))
//                {
//                	ret += 0x02;
////                    PRINTF("\r\nError: hwtimer callback registration.\r\n");
//                }
//                if (kHwtimerSuccess != HWTIMER_SYS_Start(&hwtimer))
//                {
//                	ret += 0x04;
////                    PRINTF("\r\nError: hwtimer start.\r\n");
//                }
//
//    	PRINTF("hello %x\r\n", ret);
//    }
//
//while(1);



