Belief997/lab-Micro_power_consumption_backscatter/KinetisSDK/examples/frdmkl03z/demo_apps/power_manager_hal_demo/main.c
    // Print the initial banner
    PRINTF("\r\nHwtimer Example \r\n");

    // Hwtimer initialization
    if (kHwtimerSuccess != HWTIMER_SYS_Init(&hwtimer, &HWTIMER_LL_DEVIF, HWTIMER_LL_ID, NULL))
    {
        PRINTF("\r\nError: hwtimer initialization.\r\n");
    }


    uint32_t freq = 0;
    CLOCK_SYS_GetFreq(kCoreClock, &freq);
    PRINTF("    Core Clock = %dHz \r\n", freq);


    /*
     * In case you wish to raise the Systick ISR priority, then use the below command with the
     * appropriate priority setting:
     * NVIC_SetPriority(SysTick_IRQn, isrPrior);
     */
    NVIC_SetPriority(SysTick_IRQn, HWTIMER_ISR_PRIOR);

    if (kHwtimerSuccess != HWTIMER_SYS_SetPeriod(&hwtimer, HWTIMER_PERIOD))
    {
        PRINTF("\r\nError: hwtimer set period.\r\n");
    }
    if (kHwtimerSuccess != HWTIMER_SYS_RegisterCallback(&hwtimer, hwtimer_callback, NULL))
    {
        PRINTF("\r\nError: hwtimer callback registration.\r\n");
    }
    if (kHwtimerSuccess != HWTIMER_SYS_Start(&hwtimer))
    {
        PRINTF("\r\nError: hwtimer start.\r\n");
    }

    // Wait for Hardware Timer interrupts
    while(1)
    {}
































//    while (flag)
//    {
//        mode = 0;
//
//        CLOCK_SYS_GetFreq(kCoreClock, &freq);
//        PRINTF("\r\n Demo %s %s \r\n\r\n", __DATE__, __TIME__);
//        PRINTF("    Core Clock = %dHz \r\n", freq);
//        displayPowerMode();
//
////        PRINTF("\r\nSelect the desired operation \r\n\r\n");
////        PRINTF("Press  %c for enter: RUN   - Normal RUN mode\r\n",kDemoRun);
////        PRINTF("Press  %c for enter: Wait  - Wait mode\r\n",kDemoWait);
////        PRINTF("Press  %c for enter: Stop  - Stop mode\r\n",kDemoStop);
////        PRINTF("Press  %c for enter: VLPR  - Very Low Power Run mode\r\n",kDemoVlpr);
////        PRINTF("Press  %c for enter: VLPW  - Very Low Power Wait mode\r\n",kDemoVlpw);
////        PRINTF("Press  %c for enter: VLPS  - Very Low Power Stop mode\r\n",kDemoVlps);
////        PRINTF("Press  %c for enter: VLLS0 - Very Low Leakage Stop 0 mode\r\n",kDemoVlls0);
////
////        PRINTF("Press  %c for enter: VLLS1 - Very Low Leakage Stop 1 mode\r\n",kDemoVlls1);
////        PRINTF("Press  %c for enter: VLLS3 - Very Low Leakage Stop 3 mode\r\n",kDemoVlls3);
//
////        PRINTF("\r\nWaiting for key press..\r\n\r\n");
//        PRINTF("\r\nWait\r\n");
//
//        // Wait for user response
//        testVal = (demo_power_modes_t)GETCHAR();
//
//        if ((testVal >= 'a') && (testVal <= 'z'))
//        {
//            testVal -= 'a' - 'A';
//        }
//
//        if (testVal > kDemoMin && testVal < kDemoMax)
//        {
//
//            mode = testVal - kDemoMin - 1;
//
//            switch (testVal)
//            {
//#if 0
//                case kDemoWait:
//                    if (POWER_SYS_GetCurrentMode() == kPowerManagerVlpr)
//                    {
//                        PRINTF("Can not go from VLPR to WAIT directly\r\n");
//                        break;
//                    }
//                    setWakeUpSource(selectWakeUpSource(testVal),"Wait mode");
//
//                    ret = POWER_SYS_SetMode(mode, kPowerManagerPolicyAgreement);
//                    CHECK_RET_VAL(ret, mode);
//
//                    break;
//
//                case kDemoStop:
//                    if (POWER_SYS_GetCurrentMode() == kPowerManagerVlpr)
//                    {
//                        PRINTF("Can not go from VLPR to STOP directly\r\n");
//                        break;
//                    }
//                    setWakeUpSource(selectWakeUpSource(testVal),"Stop mode");
//
//                    ret = POWER_SYS_SetMode(mode, kPowerManagerPolicyAgreement);
//
//                    CHECK_RET_VAL(ret, mode);
//
//                    // update Clock Mode
//                    update_clock_mode(CLOCK_RUN);
//                    break;
//#endif
//                case kDemoVlpr:
//                    if(kPowerManagerVlpr != POWER_SYS_GetCurrentMode())
//                    {
//                        update_clock_mode(CLOCK_VLPR);
////                        PRINTF("Entering Very Low Power Run mode\r\n");
//                        PRINTF("VLPR\r\n");
//                        ret = POWER_SYS_SetMode(mode, kPowerManagerPolicyAgreement);
//                        CHECK_RET_VAL(ret, mode);
//                    }
//                    else
//                    {
////                        PRINTF("Very Low Power Run mode already active\r\n");
//                        PRINTF("VLPR  already \r\n");
//                    }
//                    break;
//#if 0
//                case kDemoVlpw:
//                    if (POWER_SYS_GetCurrentMode() == kPowerManagerRun)
//                    {
//                        PRINTF("Can not go from RUN to VLPW directly\r\n");
//                        break;
//                    }
//                    setWakeUpSource(selectWakeUpSource(testVal),"Very Low Wait mode");
//                    ret = POWER_SYS_SetMode(mode, kPowerManagerPolicyAgreement);
//                    CHECK_RET_VAL(ret, mode);
//                    break;
//
//                case kDemoVlps:
//                    setWakeUpSource(selectWakeUpSource(testVal),"Very Low Power Stop mode");
//                    ret = POWER_SYS_SetMode(mode, kPowerManagerPolicyAgreement);
//
//                    if (POWER_SYS_GetCurrentMode() == kPowerManagerRun)
//                    {
//                        // update Clock Mode to Run
//                        update_clock_mode(CLOCK_RUN);
//                    }
//
//                    CHECK_RET_VAL(ret, mode);
//                    break;
//                case kDemoVlls0:
//                    setWakeUpSource(selectWakeUpSource(testVal),"Very Low Leakage Stop 0 mode");
//                    PRINTF("Wake up goes through Reset sequence.\r\n");
//                    ret = POWER_SYS_SetMode(mode, kPowerManagerPolicyAgreement);
//                    CHECK_RET_VAL(ret, mode);
//
//                    break;
//                case kDemoVlls1:
//                    setWakeUpSource(selectWakeUpSource(testVal),"Very Low Leakage Stop 1 mode");
//                    PRINTF("Wake up goes through Reset sequence.\r\n");
//                    ret = POWER_SYS_SetMode(mode, kPowerManagerPolicyAgreement);
//                    CHECK_RET_VAL(ret, mode);
//                    break;
//#endif
//                case kDemoVlls3:
//                    setWakeUpSource(selectWakeUpSource(testVal),"Very Low Leakage Stop 3 mode");
//                    PRINTF("Wake up goes through Reset sequence.\r\n");
//                    ret = POWER_SYS_SetMode(mode, kPowerManagerPolicyAgreement);
//                    CHECK_RET_VAL(ret, mode);
//
//                    break;
//#if 0
//                case kDemoRun:
//                    ret = POWER_SYS_SetMode(mode, kPowerManagerPolicyAgreement);
//
//                    if (ret != kPowerManagerSuccess)
//                    {
//                        PRINTF("POWER_SYS_SetMode(%u) returned unexpected status : %u\r\n",mode,ret);
//                    }
//                    else
//                    {
//                        update_clock_mode(CLOCK_RUN);
//                    }
//                    break;
//#endif
//                default:
////                    PRINTF("Wrong value");
//                    break;
//            }
//
////            PRINTF("\r\nNext loop\r\n");
//        }
//    }
}

///////////////////////////////////////////////////////////////////////////////
// EOF
///////////////////////////////////////////////////////////////////////////////
